In [2]:
import pandas as pd
import seaborn as srn
import statistics as sts

In [3]:
#Importando dados CSV
alunos = pd.read_csv("alunos.csv", sep=";")
dengue = pd.read_csv("dengue.csv", sep=";")
onibus = pd.read_csv("onibus.csv", sep=";")

In [5]:
#Mostrando dados Alunos
alunos.head()

,ID,Nome,Nome da Mae,Nome do Pai,Sexo,Data de Nascimento
0,0,FRANCISCA SALES LIMA,ELISEU CASTRO LIMA,SANDRA SALES CHAGAS,f,10-7-1997 00:00:00
1,1,DARIO MELO CELISMAN,JOAO SILVA CELISMAN,MARIA MELO MARLETE,m,24-3-2022 00:00:00
2,2,ANTONIA SILVA BARBOSA,RAIMUNDO,MARIA SILVA GIRAO,f,68-9-2009 00:00:00
3,3,SAMARA SANTOS MONTEIRO,JOSE,MARIA SANTOS LIDUINA,f,25-4-1999 00:00:00
4,4,JESSICA,FRANCISCO ALMEIDA SOUSA,RAIMUNDA SOCORRO HERMINIO,f,18-11-1998 00:00:00

In [6]:
#Mostrando dados Dengue
dengue.head()

,ID,Nome,Nome da Mae,Nome do Pai,Sexo,Data de Nascimento,Data da Dengue
0,0,MARCIA VASCONCELOS SILVA,JEFFERSON FERREIRA SILVA,MARIA VASCONCELOS LEITE,F,0/2/8976,30/8/1687
1,1,WESLEY SANTOS FILHO,JOAO SILVA FILHO,MARILIA SANTOS MACEDO,M,1/6/1288,30/1/1971
2,2,EVELINE SILVA MIGUEL,FRANCISCO MIGUEL SILVA,MARIA SITVA SIOVP,F,4/10/2002,25/9/2016
3,3,GISELE,IVONALDO FREITAS ALVES,CRISTIANE SANTOS SANTOS,F,13/6/1907,5/8/2011
4,4,GISELKE COELHO OLIVEIRA,GUTEMBERGUE SANTOS OLIVEIRA,MARIA C A,F,18/3/8961,9/10/2079

In [13]:
#Mostrando dados Onibus
onibus.head()

,ID,Nome,Nome da Mae,Nome do Pai,Sexo,Data de Nascimento,Onibus
0,0,LUCAS,EDIBERTO FARIAS MATOS,MFRIA BARAOSFEDREUFA,H,271988,"893, 529, 744, 718, 709"
1,1,PIULO Q F,ANTONIO,MARIA QUEIROZ SANTOS,H,161956,"912, 223, 689, 333, 754, 537, 779, 203, 569"
2,2,FRANCISCO S S,JEOVA OLIVEIRA SILVA,VERANEIDE SANTOS SILVA,H,2471938,"397, 213, 767"
3,3,GERANIO SILVA SOUZA,GONZAGA,ELIZABETH SILVA VALE,H,1101993,"574, 583, 726, 184"
4,4,VALBERLANIA COSTA FREITAS,OSMAR NASCIMENTO FREITAS,ANA COSTA NASCIMENTO,M,101067,"010, 152"

In [14]:
#Tamanho dados Alunos
alunos.shape

(289, 6)

In [15]:
#Tamanho dados Dengue
dengue.shape

(212, 7)

In [16]:
#Tamanho dados Onibus
onibus.shape

(278, 7)

In [25]:
#Analisando colunas dos dados de Alunos
#Nome
agrupado = alunos.groupby(['Nome']).size()
agrupado
#281 de 289 valores repetidos ou vazios

Nome
ADILSON SANTOS WELLINGTON    1
ADRIANA G F                  1
ADRIEL FRANCA LOPES          1
ADRIELLE MARIA SANTOS        1
AHEREZA L S                  1
                            ..
WERMESON GORETE OLIVEIRA     1
WEVERLANNE AQUINO BOMFIM     1
WUKA NASOIMENTP AANELHA      1
YEGOR ALVES NETO             1
YUDI SILVA CUNHA             1
Length: 281, dtype: int64

In [26]:
agrupado = alunos.groupby(['Sexo']).size()
agrupado
#nenhuma divergencia observada

Sexo
f    152
m    137
dtype: int64

In [27]:
agrupado = alunos.groupby(['Nome da Mae']).size()
agrupado
#264 de 289 valores repetidos ou vazios

Nome da Mae
ABDORAL                        1
ABELARDO ALMEIDA SOUSA         1
ABERLADO MONTEIRO GUIMARAES    1
AEDRO RIBEIRO SOBRINHO         1
ALFREDO MOURA FERREIRA         1
                              ..
VAULO                          1
VENANCIO SILVA AMARAL          1
VICENTE LIMA CARVALHO          1
WCLLIIGSOJ ALVEU BOFFIM        1
ZUGUIDO C M                    1
Length: 264, dtype: int64

In [28]:
agrupado = alunos.groupby(['Nome do Pai']).size()
agrupado
#266 de 289 valores repetidos ou vazios

Nome do Pai
ADRIANA C S                  1
ALDEVAM EVENICE SAMPAIO      1
ALESNIAAFATIMA SOHZA         1
ALEXYANDRA IVOPETE COSTJ     1
ALEZABETA                    1
                            ..
VANDA ABREU ARAUJO           1
VANIA                        1
VIVIANE CORDEIRO FEITOSA     1
WRANCTMUR OLIVEIRA SANTOS    1
YARPA N R                    1
Length: 266, dtype: int64

In [29]:
#Contamos valores NAN
alunos.isnull().sum()

ID                    0
Nome                  0
Nome da Mae           0
Nome do Pai           0
Sexo                  0
Data de Nascimento    0
dtype: int64

In [33]:
alunos[alunos.duplicated(['Nome'], keep=False)]
#Aparentemente mesmo com nomes repetidos os nomes dos pais não se repetem, ou seja, são pessoas diferentes
#Também observamos que o nome da coluna "Nome de Mae" e "Nome do Pai" estão invertidas

,ID,Nome,Nome da Mae,Nome do Pai,Sexo,Data de Nascimento
9,9,MARIA,RPIMUNDO VIANA ALVES,MARGARIDA MARINETE BEZERRA,f,2-7-2044 00:00:00
47,47,MARIA,MANOEL NONATO AVELINO,MARIA C P,f,27-4-0057 00:00:00
83,83,MARIA,RAIMUNOO,ELIANE PEREIRA MARIA,f,9-6-1998 00:00:00
86,86,MARIA,FRANCISCO PEREIRA LIMA,ANTONIA CLEIDE SANTOS,f,9-5-1394 00:00:00
174,174,MARIA,MANOEL OLIVEIRA SILVA,MARIA CARMO SILVA,f,27-8-5087 00:00:00
186,186,FRANCISCO,FRANCISCO F S,FRANCISCA SILVA PRAZERES,m,8-10-2204 00:00:00
226,226,MARIA,PEDRO,DAMIANY,f,20-81-2012 00:00:00
239,239,MARIA,FRANCISCO S T,MARIA PEREIRA CAVALCANTE,f,42-3-1697 00:00:00
248,248,MARIA,JULIO S S,FABIOLA PAULA PEREIRA,f,19-8-1991 00:00:00
281,281,FRANCISCO,EUGENIO ERIVAN ALVES,ELIZONETE JOSE PEREIRA,m,64-4-2012 00:00:00

In [35]:
#Corrigindo nome de coluna
alunos.columns = ['ID','Nome','Nome do Pai','Nome da Mae','Sexo','Data de Nascimento']
#verificando
alunos.head()

,ID,Nome,Nome do Pai,Nome da Mae,Sexo,Data de Nascimento
0,0,FRANCISCA SALES LIMA,ELISEU CASTRO LIMA,SANDRA SALES CHAGAS,f,10-7-1997 00:00:00
1,1,DARIO MELO CELISMAN,JOAO SILVA CELISMAN,MARIA MELO MARLETE,m,24-3-2022 00:00:00
2,2,ANTONIA SILVA BARBOSA,RAIMUNDO,MARIA SILVA GIRAO,f,68-9-2009 00:00:00
3,3,SAMARA SANTOS MONTEIRO,JOSE,MARIA SANTOS LIDUINA,f,25-4-1999 00:00:00
4,4,JESSICA,FRANCISCO ALMEIDA SOUSA,RAIMUNDA SOCORRO HERMINIO,f,18-11-1998 00:00:00

In [43]:
#Analisando colunas dos dados de Dengue
agrupado = dengue.groupby(['Nome']).size()
agrupado
#207 de 212 valores repetidos ou vazios

Nome
ADILSON S W               1
ADRIANA ANTONIA KLEBER    1
ADRIELLE MARIA SANTOS     1
ALEXANDRE                 1
ALINE ARAUJO GILBERTO     1
                         ..
WILLIAN                   1
WLADEYLSON COSTA JOSE     1
YLDI OFLVACUNWA           1
YRUNO                     1
YURI MARIA SILVA          1
Length: 207, dtype: int64

In [44]:
agrupado = dengue.groupby(['Nome da Mae']).size()
agrupado
#199 de 212 valores repetidos ou vazios

Nome da Mae
ABELARDO ALMEIDA SOUSA         1
ADALBERTO B L                  1
ADRIANO F S                    1
ALEX NASCIMENTO ARAUJO         1
ALLESSON R S                   1
                              ..
VRANCISCO SILVB SOSSA          1
WELINGTON IDANILDO MACELINO    1
WELLINGTON                     1
YURI CARLOS SOUSA              1
ZACARIAS                       1
Length: 199, dtype: int64

In [46]:
agrupado = dengue.groupby(['Nome do Pai']).size()
agrupado
#199 de 212 valores repetidos ou vazios

Nome do Pai
ADRIANA ALMEIDA OLIVEIRA    1
ADRIENE SOUTO LINHARES      1
ALEXSANDRA H P              1
ALICE                       1
ALINE                       1
                           ..
TEREZINHA                   1
VALDECIRA PAIVASINVA        1
VALERIA SILVA LUCAS         1
VELMA SOUZA SOUSA           1
VLIANE XEREIRA TARIA        1
Length: 199, dtype: int64

In [47]:
agrupado = alunos.groupby(['Sexo']).size()
agrupado
#nenhuma divergencia observada

Sexo
f    152
m    137
dtype: int64

In [48]:
#Contamos valores NAN
dengue.isnull().sum()

ID                    0
Nome                  0
Nome da Mae           0
Nome do Pai           0
Sexo                  0
Data de Nascimento    0
Data da Dengue        0
dtype: int64

In [49]:
alunos[alunos.duplicated(['Nome'], keep=False)]
#Aparentemente mesmo com nomes repetidos os nomes dos pais não se repetem, ou seja, são pessoas diferentes
#Também observamos que o nome da coluna "Nome de Mae" e "Nome do Pai" estão invertidas

,ID,Nome,Nome do Pai,Nome da Mae,Sexo,Data de Nascimento
9,9,MARIA,RPIMUNDO VIANA ALVES,MARGARIDA MARINETE BEZERRA,f,2-7-2044 00:00:00
47,47,MARIA,MANOEL NONATO AVELINO,MARIA C P,f,27-4-0057 00:00:00
83,83,MARIA,RAIMUNOO,ELIANE PEREIRA MARIA,f,9-6-1998 00:00:00
86,86,MARIA,FRANCISCO PEREIRA LIMA,ANTONIA CLEIDE SANTOS,f,9-5-1394 00:00:00
174,174,MARIA,MANOEL OLIVEIRA SILVA,MARIA CARMO SILVA,f,27-8-5087 00:00:00
186,186,FRANCISCO,FRANCISCO F S,FRANCISCA SILVA PRAZERES,m,8-10-2204 00:00:00
226,226,MARIA,PEDRO,DAMIANY,f,20-81-2012 00:00:00
239,239,MARIA,FRANCISCO S T,MARIA PEREIRA CAVALCANTE,f,42-3-1697 00:00:00
248,248,MARIA,JULIO S S,FABIOLA PAULA PEREIRA,f,19-8-1991 00:00:00
281,281,FRANCISCO,EUGENIO ERIVAN ALVES,ELIZONETE JOSE PEREIRA,m,64-4-2012 00:00:00